examples/openfoam/LiquefactionExample/system/controlDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoamYade;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.00001;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;



libs (
"libOpenFOAM.so"
"libsimpleSwakFunctionObjects.so"
"libswakFunctionObjects.so"
"libgroovyBC.so"
);
// ************************************************************************* //

// ************************************************************************* //
