examples/openfoam/LiquefactionExample/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          160;
        startFace       7252;
    }
    bottom
    {
        type            patch;
        nFaces          160;
        startFace       7412;
    }
    inlet
    {
        type            patch;
        nFaces          68;
        startFace       7572;
    }
    outlet
    {
        type            patch;
        nFaces          68;
        startFace       7640;
    }
    front
    {
        type            patch;
        nFaces          680;
        startFace       7708;
    }
    back
    {
        type            patch;
        nFaces          680;
        startFace       8388;
    }
)

// ************************************************************************* //
