examples/openfoam/LiquefactionExample/constant/transportProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhaseName fluid;

rho.fluid         1000; 
partDensity       2500; 

nu              [0 2 -1 0 0 0 0] 1e-06;
partDensity     [1 -3 0 0 0 0 0] 2500; 
transportModel  Newtonian;

// ************************************************************************* //
